# УРОК 5: ВВОД И ВЫВОД ДАННЫХ

## 🎯 Цели урока:
- Научиться получать данные от пользователя с помощью `input()`
- Выводить результаты с помощью `print()`
- Использовать условные операторы для принятия решений
- Перебирать элементы кортежа с помощью цикла `for`

## 📚 Теоретический материал

### Ввод данных
Функция `input()` позволяет получить текст от пользователя:
```python
name = input("Как тебя зовут? ")
print(f"Привет, {name}!")
```

### Условные операторы
Оператор `if` позволяет выполнять код только при определенных условиях:
```python
age = 15
if age >= 16:
    print("Ты можешь водить машину!")
else:
    print("Еще рано учиться вождению")
```

### Кортежи и циклы
Кортеж - это неизменяемый список. Его можно перебирать в цикле:
```python
colors = ("красный", "синий", "зеленый")
for color in colors:
    print(f"Цвет: {color}")
```

---

## 🎮 ПРАКТИЧЕСКИЕ ЗАДАНИЯ

### ЗАДАНИЕ 1: Простые операции с вводом/выводом

Напишите программу, которая:
1. Спросит у пользователя его имя
2. Спросит его возраст (число)
3. Спросит сколько лет он хочет прожить
4. Вычислит, сколько лет осталось жить
5. Выведет результат в красивом формате

**Пример работы программы:**
```
Как тебя зовут? Алексей
Сколько тебе лет? 12
Сколько лет ты хочешь прожить? 80
Привет, Алексей! Тебе 12 лет, осталось жить 68 лет!
```

**Подсказка:**
- Используйте `int()` для преобразования строки в число
- Для вычислений используйте обычные математические операторы

---

### ЗАДАНИЕ 2: Условный оператор - оценка настроения

Напишите программу, которая:
1. Спросит у пользователя, как его настроение (от 1 до 10)
2. В зависимости от числа выведет соответствующее сообщение:
   - 1-3: "Плохое настроение 😞"
   - 4-6: "Среднее настроение 😐"
   - 7-8: "Хорошее настроение 😊"
   - 9-10: "Отличное настроение 😄"
   - Любое другое число: "Неправильное значение! Введите число от 1 до 10"

**Пример работы программы:**
```
Как твое настроение по шкале от 1 до 10? 8
Хорошее настроение 😊
```

**Подсказка:**
- Используйте `if-elif-else` конструкцию
- Преобразуйте ввод в число с помощью `int()`
- Проверьте границы значений

---

### ЗАДАНИЕ 3: Перебор кортежа - любимые игры

Напишите программу, которая:
1. Создаст кортеж с названиями игр
2. Переберет все игры в цикле `for`
3. Для каждой игры выведет "Мне нравится играть в [название игры]!"

**Пример работы программы:**
```
Мне нравится играть в Марио!
Мне нравится играть в Тетрис!
Мне нравится играть в Змею!
Мне нравится играть в Гонку!
```

**Подсказка:**
- Создайте кортеж с названиями игр
- Используйте цикл `for` для перебора
- Выведите сообщение для каждой игры

---

## 🎯 Критерии оценки:

### Задание 1:
- ✅ Правильный ввод имени (строка)
- ✅ Правильный ввод возраста (число)
- ✅ Правильный ввод желаемого возраста (число)
- ✅ Правильные вычисления
- ✅ Красивый вывод результата

### Задание 2:
- ✅ Правильная обработка всех диапазонов настроения
- ✅ Правильная обработка неправильных значений
- ✅ Понятные сообщения для пользователя
- ✅ Правильная работа с числами

### Задание 3:
- ✅ Создан кортеж с играми
- ✅ Правильный перебор в цикле for
- ✅ Вывод для каждой игры
- ✅ Корректный синтаксис

---

## 🚀 Следующие шаги:

После выполнения этих заданий вы сможете:
- Создавать интерактивные программы
- Принимать решения на основе пользовательского ввода
- Обрабатывать коллекции данных
- Комбинировать разные конструкции Python

**Удачи в выполнении заданий! 🎮**
